In [1]:
import pandas as pd
import numpy as np

## Importing the dataset

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

users = pd.read_csv(url, sep= "|")

In [3]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

## Assigning 'user_id' as index

In [4]:
users = users.set_index('user_id')

In [5]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

## First 10 and Last 10 entries

In [6]:
print('--------First 10 entries -------')
users.head(10)

--------First 10 entries -------

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [7]:
print('--------Last 10 entries -------')
users.tail(10)

--------Last 10 entries -------

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

## Number of observations in the dataset

In [8]:
users.count()

age           943
gender        943
occupation    943
zip_code      943
dtype: int64

## number of columns in the dataset

In [9]:
print('Number of columns :', users.shape[1])
# print(users.shape[1])

Number of columns : 4

## Printing the name of all the columns.

In [10]:
print('Name of all the columns:',(users.columns))

Name of all the columns: Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

## dataset indexing

In [14]:
###users = users.Index()

## checking the data type of each column

In [15]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

## Printing only the occupation column

In [16]:
print(users['occupation'])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

## counting different occupations in this dataset

In [17]:
users['occupation'].nunique()

21

In [18]:
users['occupation'].count()

943

## What is the most frequent occupation

In [19]:
df = pd.DataFrame(users)

In [20]:
df['occupation'].value_counts(ascending=False).head(1)

student    196
Name: occupation, dtype: int64

## DataFrame Info.

In [21]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

## Summarize only the occupation column has done already.

In [22]:
users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

## Calculating mean age of users

In [23]:
users['age'].mean()

34.05196182396607

## What is the age with least occurrence

In [24]:
users['age'].min()

7